In [26]:
# Importation des bibliothèques nécessaires pour l'analyse des données.
# - pandas : Bibliothèque puissante pour manipuler et analyser des données tabulaires.
import pandas as pd

In [27]:
# Chargement des données depuis un fichier Excel.
# - `pd.read_excel` permet de lire un fichier Excel et de le convertir en DataFrame.
df = pd.read_excel(r"C:\Users\Lenovo\Documents\Python\Donnees.xlsx")
# - Affichage des 5 premières lignes pour vérifier que les données ont été chargées correctement.
print(df.head(5))

   Nombre prénoms déclarés Sexe  Annee    Prenoms  \
0                      106    F   2022  Joséphine
1                       66    M   2022    Léonard
2                       63    F   2022       Maya
3                       59    F   2022    Céleste
4                       57    M   2022       Noam

   Nombre total cumule par annee
0                            106
1                             66
2                             63
3                             59
4                             57

In [28]:
# Affichage des colonnes disponibles dans le DataFrame.
# - Permet de vérifier les noms et la structure des colonnes.
df.columns

Index(['Nombre prénoms déclarés', 'Sexe', 'Annee', 'Prenoms',
       'Nombre total cumule par annee'],
      dtype='object')

In [29]:
# Affichage de la taille du DataFrame.
# - Retourne le nombre de lignes et de colonnes pour comprendre la quantité de données.
df.shape

(25465, 5)

In [30]:
# Affichage des 15 premières lignes du DataFrame.
# - Permet d'examiner un échantillon des données.
df.head(n=15)

,Nombre prénoms déclarés,Sexe,Annee,Prenoms,Nombre total cumule par annee
0,106,F,2022,Joséphine,106
1,66,M,2022,Léonard,66
2,63,F,2022,Maya,63
3,59,F,2022,Céleste,59
4,57,M,2022,Noam,57
5,51,M,2022,Zayn,51
6,46,F,2022,Nora,46
7,44,M,2022,Mamadou,44
8,44,F,2022,Clémence,44
9,32,F,2022,Lola,32
10,31,M,2022,Pablo,31
11,19,M,2022,Khalil,19
12,18,M,2022,Loup,18
13,18,F,2022,Eline,18
14,17,M,2022,Marc,17

In [31]:
# Affichage des types de données de chaque colonne.
# - `df.dtypes` permet de vérifier si les colonnes sont bien formatées (exemple : numérique, texte, etc.).
df.dtypes

Nombre prénoms déclarés           int64
Sexe                             object
Annee                             int64
Prenoms                          object
Nombre total cumule par annee     int64
dtype: object

In [32]:
# Génération de statistiques descriptives sur toutes les colonnes.
# - `df.describe(include='all')` résume les données : moyenne, min, max, valeurs uniques, etc.
df.describe(include='all')

,Nombre prénoms déclarés,Sexe,Annee,Prenoms,Nombre total cumule par annee
count,25465.000000,25465,25465.000000,25465,25465.000000
unique,NaN,2,NaN,2777,NaN
top,NaN,F,NaN,Sacha,NaN
freq,NaN,12962,NaN,40,NaN
mean,24.342156,NaN,2013.543805,NaN,24.638445
std,36.597041,NaN,5.698167,NaN,37.055541
min,5.000000,NaN,2004.000000,NaN,5.000000
25%,7.000000,NaN,2009.000000,NaN,7.000000
50%,11.000000,NaN,2014.000000,NaN,11.000000
75%,24.000000,NaN,2018.000000,NaN,25.000000
max,398.000000,NaN,2023.000000,NaN,398.000000

In [33]:
# Génération de statistiques descriptives pour les colonnes 'Prenoms' et 'Annee'.
sexe = df[['Prenoms', 'Annee']].describe(include='all')

In [25]:
sexe

       Prenoms         Annee
count    25465  25465.000000
unique    2777           NaN
top      Sacha           NaN
freq        40           NaN
mean       NaN   2013.543805
std        NaN      5.698167
min        NaN   2004.000000
25%        NaN   2009.000000
50%        NaN   2014.000000
75%        NaN   2018.000000
max        NaN   2023.000000

In [34]:
# Suppression des lignes contenant des valeurs manquantes.
# - Utilisez `dropna()` pour nettoyer les données.
sexe.dropna()

      Prenoms    Annee
count   25465  25465.0

In [35]:
# Remplacement des valeurs manquantes par 0.
# - Utilisez `fillna(0)` pour remplacer les NaN.
sexe.fillna(0)

       Prenoms         Annee
count    25465  25465.000000
unique    2777      0.000000
top      Sacha      0.000000
freq        40      0.000000
mean         0   2013.543805
std          0      5.698167
min          0   2004.000000
25%          0   2009.000000
50%          0   2014.000000
75%          0   2018.000000
max          0   2023.000000

In [36]:
# Filtrage des lignes où la colonne 'Sexe' est égale à "F".
# - Permet d'extraire uniquement les données féminines.
df.loc[df['Sexe']=="F",:]

,Nombre prénoms déclarés,Sexe,Annee,Prenoms,Nombre total cumule par annee
0,106,F,2022,Joséphine,106
2,63,F,2022,Maya,63
3,59,F,2022,Céleste,59
6,46,F,2022,Nora,46
8,44,F,2022,Clémence,44
...,...,...,...,...,...
25460,5,F,2023,Charline,5
25461,5,F,2023,Eleonora,5
25462,5,F,2023,Fatimata,5
25463,5,F,2023,Lilou,5
25464,5,F,2023,Lylia,5

In [19]:
df['Sexe']=="F"

0         True
1        False
2         True
3         True
4        False
         ...
25460     True
25461     True
25462     True
25463     True
25464     True
Name: Sexe, Length: 25465, dtype: bool

In [37]:
# Recherche de la valeur minimale dans la colonne "Nombre prénoms déclarés".
mini=df["Nombre prénoms déclarés"].min()

In [21]:
mini

5

In [38]:
# Recherche de la valeur maximale dans la colonne "Nombre prénoms déclarés".
maxi=df["Nombre prénoms déclarés"].max()

In [23]:
maxi

398

In [39]:
df["Nombre prénoms déclarés"].mean()

24.342155900255253

In [41]:
df["Nombre prénoms déclarés"].var()

1339.343378716625

In [42]:
df["Nombre prénoms déclarés"].std()

36.597040573202435

In [43]:
rangedf = maxi - mini

In [44]:
rangedf

393